run/gittracked/MHC/kOmegaSST/0/alpha.sludge
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      alpha.sludge;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0.000;

boundaryField
{
    bottomoutlet
    {
        type            zeroGradient;
    }
    negyinlet
    {
        type            fixedValue;
        value           uniform 0.000;
    }
    posyinlet
    {
        type            fixedValue;
        value           uniform 0.000;
    }
    topoutlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
